soynerdito/GeoCar_PSoC/PSoc4_Main.cydsn/codegentemp/PSOC5_SPI_UART.h
/*******************************************************************************
* File Name: PSOC5_SPI_UART.h
* Version 1.10
*
* Description:
*  This file provides constants and parameter values for the SCB Component in
*  SPI and UART modes.
*
* Note:
*
********************************************************************************
* Copyright 2013, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_SCB_SPI_UART_PSOC5_H)
#define CY_SCB_SPI_UART_PSOC5_H

#include "PSOC5.h"


/***************************************
*   SPI Initial Parameter Constants
****************************************/

#define PSOC5_SPI_MODE                   (0u)
#define PSOC5_SPI_SUB_MODE               (0u)
#define PSOC5_SPI_CLOCK_MODE             (0u)
#define PSOC5_SPI_OVS_FACTOR             (16u)
#define PSOC5_SPI_MEDIAN_FILTER_ENABLE   (0u)
#define PSOC5_SPI_LATE_MISO_SAMPLE_ENABLE (0u)
#define PSOC5_SPI_RX_DATA_BITS_NUM       (8u)
#define PSOC5_SPI_TX_DATA_BITS_NUM       (8u)
#define PSOC5_SPI_WAKE_ENABLE            (0u)
#define PSOC5_SPI_BITS_ORDER             (1u)
#define PSOC5_SPI_TRANSFER_SEPARATION    (1u)
#define PSOC5_SPI_NUMBER_OF_SS_LINES     (1u)
#define PSOC5_SPI_RX_BUFFER_SIZE         (8u)
#define PSOC5_SPI_TX_BUFFER_SIZE         (8u)

#define PSOC5_SPI_INTERRUPT_MODE         (0u)

#define PSOC5_SPI_INTR_RX_MASK           (0u)
#define PSOC5_SPI_INTR_TX_MASK           (0u)

#define PSOC5_SPI_RX_TRIGGER_LEVEL       (7u)
#define PSOC5_SPI_TX_TRIGGER_LEVEL       (0u)


/***************************************
*   UART Initial Parameter Constants
****************************************/

#define PSOC5_UART_SUB_MODE              (0u)
#define PSOC5_UART_DIRECTION             (3u)
#define PSOC5_UART_DATA_BITS_NUM         (8u)
#define PSOC5_UART_PARITY_TYPE           (2u)
#define PSOC5_UART_STOP_BITS_NUM         (2u)
#define PSOC5_UART_OVS_FACTOR            (12u)
#define PSOC5_UART_IRDA_LOW_POWER        (0u)
#define PSOC5_UART_MEDIAN_FILTER_ENABLE  (0u)
#define PSOC5_UART_RETRY_ON_NACK         (0u)
#define PSOC5_UART_IRDA_POLARITY         (0u)
#define PSOC5_UART_DROP_ON_FRAME_ERR     (0u)
#define PSOC5_UART_DROP_ON_PARITY_ERR    (0u)
#define PSOC5_UART_WAKE_ENABLE           (0u)
#define PSOC5_UART_RX_BUFFER_SIZE        (8u)
#define PSOC5_UART_TX_BUFFER_SIZE        (8u)
#define PSOC5_UART_MP_MODE_ENABLE        (0u)
#define PSOC5_UART_MP_ACCEPT_ADDRESS     (0u)
#define PSOC5_UART_MP_RX_ADDRESS         (2u)
#define PSOC5_UART_MP_RX_ADDRESS_MASK    (255u)

#define PSOC5_UART_INTERRUPT_MODE        (0u)

#define PSOC5_UART_INTR_RX_MASK          (0u)
#define PSOC5_UART_INTR_TX_MASK          (0u)

#define PSOC5_UART_RX_TRIGGER_LEVEL      (7u)
#define PSOC5_UART_TX_TRIGGER_LEVEL      (0u)

/* Sources of RX errors */
#define PSOC5_INTR_RX_ERR        (PSOC5_INTR_RX_OVERFLOW    | \
                                             PSOC5_INTR_RX_UNDERFLOW   | \
                                             PSOC5_INTR_RX_FRAME_ERROR | \
                                             PSOC5_INTR_RX_PARITY_ERROR)

/* UART direction enum */
#define PSOC5_UART_RX    (1u)
#define PSOC5_UART_TX    (2u)
#define PSOC5_UART_TX_RX (3u)


/***************************************
*   Conditional Compilation Parameters
****************************************/

#if(PSOC5_SCB_MODE_UNCONFIG_CONST_CFG)

    /* Direction */
    #define PSOC5_RX_DIRECTION           (1u)
    #define PSOC5_TX_DIRECTION           (1u)
    #define PSOC5_UART_RX_DIRECTION      (1u)
    #define PSOC5_UART_TX_DIRECTION      (1u)

    /* Only external RX and TX buffer for uncofigured mode */
    #define PSOC5_INTERNAL_RX_SW_BUFFER   (0u)
    #define PSOC5_INTERNAL_TX_SW_BUFFER   (0u)

    /* Get RX and TX buffer size */
    #define PSOC5_RX_BUFFER_SIZE (PSOC5_rxBufferSize)
    #define PSOC5_TX_BUFFER_SIZE (PSOC5_txBufferSize)

    /* Return true if buffer is provided */
    #define PSOC5_CHECK_RX_SW_BUFFER (NULL != PSOC5_rxBuffer)
    #define PSOC5_CHECK_TX_SW_BUFFER (NULL != PSOC5_txBuffer)

    /* Alwasy provde global variables to support RX and TX buffers */
    #define PSOC5_INTERNAL_RX_SW_BUFFER_CONST    (1u)
    #define PSOC5_INTERNAL_TX_SW_BUFFER_CONST    (1u)

    /* Get wakeup enable option */
    #define PSOC5_SPI_WAKE_ENABLE_CONST  (1u)
    #define PSOC5_CHECK_SPI_WAKE_ENABLE  (0u != PSOC5_scbEnableWake)
    #define PSOC5_UART_WAKE_ENABLE_CONST (1u)

#else

    /* SPI internal RX and TX buffers */
    #define PSOC5_INTERNAL_SPI_RX_SW_BUFFER  (PSOC5_SPI_RX_BUFFER_SIZE > \
                                                                                            PSOC5_FIFO_SIZE)
    #define PSOC5_INTERNAL_SPI_TX_SW_BUFFER  (PSOC5_SPI_TX_BUFFER_SIZE > \
                                                                                            PSOC5_FIFO_SIZE)

    /* UART internal RX and TX buffers */
    #define PSOC5_INTERNAL_UART_RX_SW_BUFFER  (PSOC5_UART_RX_BUFFER_SIZE > \
                                                                                            PSOC5_FIFO_SIZE)
    #define PSOC5_INTERNAL_UART_TX_SW_BUFFER  (PSOC5_UART_TX_BUFFER_SIZE > \
                                                                                            PSOC5_FIFO_SIZE)

    /* SPI Direction */
    #define PSOC5_SPI_RX_DIRECTION (1u)
    #define PSOC5_SPI_TX_DIRECTION (1u)

    /* UART Direction */
    #define PSOC5_UART_RX_DIRECTION (0u != (PSOC5_UART_DIRECTION & PSOC5_UART_RX))
    #define PSOC5_UART_TX_DIRECTION (0u != (PSOC5_UART_DIRECTION & PSOC5_UART_TX))

    /* Direction */
    #define PSOC5_RX_DIRECTION ((PSOC5_SCB_MODE_SPI_CONST_CFG) ? \
                                            (PSOC5_SPI_RX_DIRECTION) : (PSOC5_UART_RX_DIRECTION))

    #define PSOC5_TX_DIRECTION ((PSOC5_SCB_MODE_SPI_CONST_CFG) ? \
                                            (PSOC5_SPI_TX_DIRECTION) : (PSOC5_UART_TX_DIRECTION))

