soynerdito/GeoCar_PSoC/PSoc4_Main.cydsn/codegentemp/PSOC5_SPI_UART.h
    /* Internal RX and TX buffer: for SPI or UART */
    #if(PSOC5_SCB_MODE_SPI_CONST_CFG)

        /* Internal SPI RX and TX buffer */
        #define PSOC5_INTERNAL_RX_SW_BUFFER  (PSOC5_INTERNAL_SPI_RX_SW_BUFFER)
        #define PSOC5_INTERNAL_TX_SW_BUFFER  (PSOC5_INTERNAL_SPI_TX_SW_BUFFER)

        /* Internal SPI RX and TX buffer size */
        #define PSOC5_RX_BUFFER_SIZE         (PSOC5_SPI_RX_BUFFER_SIZE + 1u)
        #define PSOC5_TX_BUFFER_SIZE         (PSOC5_SPI_TX_BUFFER_SIZE)
        
        /* Get wakeup enable option */
        #define PSOC5_SPI_WAKE_ENABLE_CONST  (0u != PSOC5_SPI_WAKE_ENABLE)
        #define PSOC5_UART_WAKE_ENABLE_CONST (0u)

    #else

        /* Internal UART RX and TX buffer */
        #define PSOC5_INTERNAL_RX_SW_BUFFER  (PSOC5_INTERNAL_UART_RX_SW_BUFFER)
        #define PSOC5_INTERNAL_TX_SW_BUFFER  (PSOC5_INTERNAL_UART_TX_SW_BUFFER)

        /* Internal UART RX and TX buffer size */
        #define PSOC5_RX_BUFFER_SIZE         (PSOC5_UART_RX_BUFFER_SIZE + 1u)
        #define PSOC5_TX_BUFFER_SIZE         (PSOC5_UART_TX_BUFFER_SIZE)
        
        /* Get wakeup enable option */
        #define PSOC5_SPI_WAKE_ENABLE_CONST  (0u)
        #define PSOC5_UART_WAKE_ENABLE_CONST (0u != PSOC5_UART_WAKE_ENABLE)
    #endif /* (PSOC5_SCB_MODE_SPI_CONST_CFG) */

    /* Internal RX and TX buffer: for SPI or UART. Used in conditional compilation check */
    #define PSOC5_CHECK_RX_SW_BUFFER (PSOC5_INTERNAL_RX_SW_BUFFER)
    #define PSOC5_CHECK_TX_SW_BUFFER (PSOC5_INTERNAL_TX_SW_BUFFER)

    /* Provide global variables to support RX and TX buffers */
    #define PSOC5_INTERNAL_RX_SW_BUFFER_CONST    (PSOC5_INTERNAL_RX_SW_BUFFER)
    #define PSOC5_INTERNAL_TX_SW_BUFFER_CONST    (PSOC5_INTERNAL_TX_SW_BUFFER)
    
    /* Wakeup for SPI */
    #define PSOC5_CHECK_SPI_WAKE_ENABLE  (PSOC5_SPI_WAKE_ENABLE_CONST)

#endif /* End (PSOC5_SCB_MODE_UNCONFIG_CONST_CFG) */

/* Bootloader communication interface enable: NOT supported yet */
#define PSOC5_SPI_BTLDR_COMM_ENABLED   ((CYDEV_BOOTLOADER_IO_COMP == CyBtldr_PSOC5) || \
                                                    (CYDEV_BOOTLOADER_IO_COMP == CyBtldr_Custom_Interface))

#define PSOC5_UART_BTLDR_COMM_ENABLED   ((CYDEV_BOOTLOADER_IO_COMP == CyBtldr_PSOC5) || \
                                                    (CYDEV_BOOTLOADER_IO_COMP == CyBtldr_Custom_Interface))


/***************************************
*       Type Definitions
***************************************/

/* PSOC5_SPI_INIT_STRUCT */
typedef struct
{
    uint32 mode;
    uint32 submode;
    uint32 sclkMode;
    uint32 oversample;
    uint32 enableMedianFilter;
    uint32 enableLateSampling;
    uint32 enableWake;
    uint32 rxDataBits;
    uint32 txDataBits;
    uint32 bitOrder;
    uint32 transferSeperation;
    uint32 rxBufferSize;
    uint8* rxBuffer;
    uint32 txBufferSize;
    uint8* txBuffer;
    uint32 enableInterrupt;
    uint32 rxInterruptMask;
    uint32 rxTriggerLevel;
    uint32 txInterruptMask;
    uint32 txTriggerLevel;
} PSOC5_SPI_INIT_STRUCT;

/* PSOC5_UART_INIT_STRUCT */
typedef struct
{
    uint32 mode;
    uint32 direction;
    uint32 dataBits;
    uint32 parity;
    uint32 stopBits;
    uint32 oversample;
    uint32 enableIrdaLowPower;
    uint32 enableMedianFilter;
    uint32 enableRetryNack;
    uint32 enableInvertedRx;
    uint32 dropOnParityErr;
    uint32 dropOnFrameErr;
    uint32 enableWake;
    uint32 rxBufferSize;
    uint8* rxBuffer;
    uint32 txBufferSize;
    uint8* txBuffer;
    uint32 enableMultiproc;
    uint32 multiprocAcceptAddr;
    uint32 multiprocAddr;
    uint32 multiprocAddrMask;
    uint32 enableInterrupt;
    uint32 rxInterruptMask;
    uint32 rxTriggerLevel;
    uint32 txInterruptMask;
    uint32 txTriggerLevel;
} PSOC5_UART_INIT_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

/* SPI specific functions */
#if(PSOC5_SCB_MODE_UNCONFIG_CONST_CFG)
    void PSOC5_SpiInit(const PSOC5_SPI_INIT_STRUCT *config);
#endif /* (PSOC5_SCB_MODE_UNCONFIG_CONST_CFG) */

#if(PSOC5_SCB_MODE_SPI_INC)
    void PSOC5_SpiSetActiveSlaveSelect(uint32 activeSelect);
#endif /* (PSOC5_SCB_MODE_SPI_INC) */

/* UART specific functions */
#if(PSOC5_SCB_MODE_UNCONFIG_CONST_CFG)
    void PSOC5_UartInit(const PSOC5_UART_INIT_STRUCT *config);
#endif /* (PSOC5_SCB_MODE_UNCONFIG_CONST_CFG) */

#if(PSOC5_SCB_MODE_UART_INC)
    void PSOC5_UartSetRxAddress(uint32 address);
    void PSOC5_UartSetRxAddressMask(uint32 addressMask);
#endif /* (PSOC5_SCB_MODE_UART_INC) */

/* UART RX direction APIs */
#if(PSOC5_UART_RX_DIRECTION)
    uint32 PSOC5_UartGetChar(void);
    uint32 PSOC5_UartGetByte(void);
#endif /* (PSOC5_UART_RX_DIRECTION) */

/* UART TX direction APIs */
#if(PSOC5_UART_TX_DIRECTION)
    #define PSOC5_UartPutChar(ch)    PSOC5_SpiUartWriteTxData((uint32)(ch))
    void PSOC5_UartPutString(const char8 string[]);
    void PSOC5_UartPutCRLF(uint32 txDataByte);
#endif /* (PSOC5_UART_TX_DIRECTION) */

/* Common APIs Rx direction */
#if(PSOC5_RX_DIRECTION)
    uint32 PSOC5_SpiUartReadRxData(void);
    uint32 PSOC5_SpiUartGetRxBufferSize(void);
    void   PSOC5_SpiUartClearRxBuffer(void);
#endif /* (PSOC5_RX_DIRECTION) */

/* Common APIs Tx direction */
#if(PSOC5_TX_DIRECTION)
    void   PSOC5_SpiUartWriteTxData(uint32 txDataByte);
    void   PSOC5_SpiUartPutArray(const uint8 wrBuf[], uint32 count);
    void   PSOC5_SpiUartClearTxBuffer(void);
    uint32 PSOC5_SpiUartGetTxBufferSize(void);
#endif /* (PSOC5_TX_DIRECTION) */

CY_ISR_PROTO(PSOC5_SPI_UART_ISR);

#if(PSOC5_UART_RX_WAKEUP_IRQ)
    CY_ISR_PROTO(PSOC5_UART_WAKEUP_ISR);
#endif /* (PSOC5_UART_RX_WAKEUP_IRQ) */

#if defined(CYDEV_BOOTLOADER_IO_COMP) && (PSOC5_SPI_BTLDR_COMM_ENABLED)
    /* SPI Bootloader physical layer functions */
    void PSOC5_SpiCyBtldrCommStart(void);
    void PSOC5_SpiCyBtldrCommStop (void);
    void PSOC5_SpiCyBtldrCommReset(void);
    cystatus PSOC5_SpiCyBtldrCommRead       (uint8 pData[], uint16 size, uint16 * count, uint8 timeOut);
    cystatus PSOC5_SpiCyBtldrCommWrite(const uint8 pData[], uint16 size, uint16 * count, uint8 timeOut);

#endif /* defined(CYDEV_BOOTLOADER_IO_COMP) && (PSOC5_SPI_BTLDR_COMM_ENABLED) */

#if defined(CYDEV_BOOTLOADER_IO_COMP) && (PSOC5_UART_BTLDR_COMM_ENABLED)
    /* UART Bootloader physical layer functions */
    void PSOC5_UartCyBtldrCommStart(void);
    void PSOC5_UartCyBtldrCommStop (void);
    void PSOC5_UartCyBtldrCommReset(void);
    cystatus PSOC5_UartCyBtldrCommRead       (uint8 pData[], uint16 size, uint16 * count, uint8 timeOut);
    cystatus PSOC5_UartCyBtldrCommWrite(const uint8 pData[], uint16 size, uint16 * count, uint8 timeOut);

