soynerdito/GeoCar_PSoC/PSoc4_Main.cydsn/codegentemp/PSOC5_SPI_UART.h
#endif /* defined(CYDEV_BOOTLOADER_IO_COMP) && (PSOC5_UART_BTLDR_COMM_ENABLED) */


/***************************************
*     Buffer Access Macro Definitions
***************************************/

#if(PSOC5_SCB_MODE_UNCONFIG_CONST_CFG)
    /* RX direction */
    void   PSOC5_PutWordInRxBuffer  (uint32 idx, uint32 rxDataByte);
    uint32 PSOC5_GetWordFromRxBuffer(uint32 idx);

    /* TX direction */
    void   PSOC5_PutWordInTxBuffer  (uint32 idx, uint32 txDataByte);
    uint32 PSOC5_GetWordFromTxBuffer(uint32 idx);

#else

    /* RX direction */
    #if(PSOC5_INTERNAL_RX_SW_BUFFER_CONST)
        #define PSOC5_PutWordInRxBuffer(idx, rxDataByte) \
                do{                                                 \
                    PSOC5_rxBufferInternal[(idx)] = ((uint8) (rxDataByte)); \
                }while(0)

        #define PSOC5_GetWordFromRxBuffer(idx) PSOC5_rxBufferInternal[(idx)]

    #endif /* (PSOC5_INTERNAL_RX_SW_BUFFER_CONST) */

    /* TX direction */
    #if(PSOC5_INTERNAL_TX_SW_BUFFER_CONST)
        #define PSOC5_PutWordInTxBuffer(idx, txDataByte) \
                    do{                                             \
                        PSOC5_txBufferInternal[(idx)] = ((uint8) (txDataByte)); \
                    }while(0)

        #define PSOC5_GetWordFromTxBuffer(idx) PSOC5_txBufferInternal[(idx)]

    #endif /* (PSOC5_INTERNAL_TX_SW_BUFFER_CONST) */

#endif /* (PSOC5_TX_SW_BUFFER_ENABLE) */


/***************************************
*         SPI API Constants
***************************************/

/* SPI mode enum */
#define PSOC5_SPI_SLAVE  (0u)
#define PSOC5_SPI_MASTER (1u)

/* SPI sub mode enum */
#define PSOC5_SPI_MODE_MOTOROLA      (0x00u)
#define PSOC5_SPI_MODE_TI_COINCIDES  (0x01u)
#define PSOC5_SPI_MODE_TI_PRECEDES   (0x11u)
#define PSOC5_SPI_MODE_NATIONAL      (0x02u)
#define PSOC5_SPI_MODE_MASK          (0x03u)
#define PSOC5_SPI_MODE_TI_PRECEDES_MASK  (0x10u)

/* SPI phase and polarity mode enum */
#define PSOC5_SPI_SCLK_CPHA0_CPOL0   (0x00u)
#define PSOC5_SPI_SCLK_CPHA0_CPOL1   (0x02u)
#define PSOC5_SPI_SCLK_CPHA1_CPOL0   (0x01u)
#define PSOC5_SPI_SCLK_CPHA1_CPOL1   (0x03u)

/* SPI bits order enum */
#define PSOC5_BITS_ORDER_LSB_FIRST   (0u)
#define PSOC5_BITS_ORDER_MSB_FIRST   (1u)

/* SPI transfer separation enum */
#define PSOC5_SPI_TRANSFER_SEPARATED     (0u)
#define PSOC5_SPI_TRANSFER_CONTINUOUS    (1u)

/* "activeSS" constants for SpiSetActiveSlaveSelect() function */
#define PSOC5_SPIM_ACTIVE_SS0    (0x00u)
#define PSOC5_SPIM_ACTIVE_SS1    (0x01u)
#define PSOC5_SPIM_ACTIVE_SS2    (0x02u)
#define PSOC5_SPIM_ACTIVE_SS3    (0x03u)


/***************************************
*         UART API Constants
***************************************/

/* UART sub-modes enum */
#define PSOC5_UART_MODE_STD          (0u)
#define PSOC5_UART_MODE_SMARTCARD    (1u)
#define PSOC5_UART_MODE_IRDA         (2u)

/* UART direction enum */
#define PSOC5_UART_RX    (1u)
#define PSOC5_UART_TX    (2u)
#define PSOC5_UART_TX_RX (3u)

/* UART parity enum */
#define PSOC5_UART_PARITY_EVEN   (0u)
#define PSOC5_UART_PARITY_ODD    (1u)
#define PSOC5_UART_PARITY_NONE   (2u)

/* UART stop bits enum */
#define PSOC5_UART_STOP_BITS_1   (1u)
#define PSOC5_UART_STOP_BITS_1_5 (2u)
#define PSOC5_UART_STOP_BITS_2   (3u)

/* UART IrDA low power OVS enum */
#define PSOC5_UART_IRDA_LP_OVS16     (16u)
#define PSOC5_UART_IRDA_LP_OVS32     (32u)
#define PSOC5_UART_IRDA_LP_OVS48     (48u)
#define PSOC5_UART_IRDA_LP_OVS96     (96u)
#define PSOC5_UART_IRDA_LP_OVS192    (192u)
#define PSOC5_UART_IRDA_LP_OVS768    (768u)
#define PSOC5_UART_IRDA_LP_OVS1536   (1536u)

/* Uart MP: mark (address) and space (data) bit definitions */
#define PSOC5_UART_MP_MARK       (0x100u)
#define PSOC5_UART_MP_SPACE      (0x000u)


/***************************************
*     Vars with External Linkage
***************************************/

#if(PSOC5_SCB_MODE_UNCONFIG_CONST_CFG)
    extern const PSOC5_SPI_INIT_STRUCT  PSOC5_configSpi;
    extern const PSOC5_UART_INIT_STRUCT PSOC5_configUart;
#endif /* (PSOC5_SCB_MODE_UNCONFIG_CONST_CFG) */


/***************************************
*    Specific SPI Macro Definitions
***************************************/

#define PSOC5_GET_SPI_INTR_SLAVE_MASK(sourceMask)  ((sourceMask) & PSOC5_INTR_SLAVE_SPI_BUS_ERROR)
#define PSOC5_GET_SPI_INTR_MASTER_MASK(sourceMask) ((sourceMask) & PSOC5_INTR_MASTER_SPI_DONE)
#define PSOC5_GET_SPI_INTR_RX_MASK(sourceMask) \
                                             ((sourceMask) & (uint32) ~PSOC5_INTR_SLAVE_SPI_BUS_ERROR)

#define PSOC5_GET_SPI_INTR_TX_MASK(sourceMask) \
                                             ((sourceMask) & (uint32) ~PSOC5_INTR_MASTER_SPI_DONE)


/***************************************
*    Specific UART Macro Definitions
***************************************/

#define PSOC5_UART_GET_CTRL_OVS_IRDA_LP(oversample) \
        ((PSOC5_UART_IRDA_LP_OVS16   == (oversample)) ? PSOC5_CTRL_OVS_IRDA_LP_OVS16 : \
         ((PSOC5_UART_IRDA_LP_OVS32   == (oversample)) ? PSOC5_CTRL_OVS_IRDA_LP_OVS32 : \
          ((PSOC5_UART_IRDA_LP_OVS48   == (oversample)) ? PSOC5_CTRL_OVS_IRDA_LP_OVS48 : \
           ((PSOC5_UART_IRDA_LP_OVS96   == (oversample)) ? PSOC5_CTRL_OVS_IRDA_LP_OVS96 : \
            ((PSOC5_UART_IRDA_LP_OVS192  == (oversample)) ? PSOC5_CTRL_OVS_IRDA_LP_OVS192 : \
             ((PSOC5_UART_IRDA_LP_OVS768  == (oversample)) ? PSOC5_CTRL_OVS_IRDA_LP_OVS768 : \
              ((PSOC5_UART_IRDA_LP_OVS1536 == (oversample)) ? PSOC5_CTRL_OVS_IRDA_LP_OVS1536 : \
                                                                          PSOC5_CTRL_OVS_IRDA_LP_OVS16)))))))

#define PSOC5_GET_UART_RX_CTRL_ENABLED(direction) ((0u != (PSOC5_UART_RX & (direction))) ? \
                                                                    (PSOC5_RX_CTRL_ENABLED) : (0u))

#define PSOC5_GET_UART_TX_CTRL_ENABLED(direction) ((0u != (PSOC5_UART_TX & (direction))) ? \
                                                                    (PSOC5_TX_CTRL_ENABLED) : (0u))


