soynerdito/GeoCar_PSoC/PSoc4_Main.cydsn/codegentemp/PSOC5_SPI_UART.h
/***************************************
*        SPI Register Settings
***************************************/

#define PSOC5_CTRL_SPI      (PSOC5_CTRL_MODE_SPI)
#define PSOC5_SPI_RX_CTRL   (PSOC5_RX_CTRL_ENABLED)
#define PSOC5_SPI_TX_CTRL   (PSOC5_TX_CTRL_ENABLED)


/***************************************
*       SPI Init Register Settings
***************************************/

#if(PSOC5_SCB_MODE_SPI_CONST_CFG)

    /* SPI Configuration */
    #define PSOC5_SPI_DEFAULT_CTRL \
                    (PSOC5_GET_CTRL_OVS(PSOC5_SPI_OVS_FACTOR)         | \
                     PSOC5_GET_CTRL_EC_AM_MODE(PSOC5_SPI_WAKE_ENABLE) | \
                     PSOC5_CTRL_SPI)

    #define PSOC5_SPI_DEFAULT_SPI_CTRL \
                    (PSOC5_GET_SPI_CTRL_CONTINUOUS    (PSOC5_SPI_TRANSFER_SEPARATION)       | \
                     PSOC5_GET_SPI_CTRL_SELECT_PRECEDE(PSOC5_SPI_SUB_MODE &                   \
                                                                  PSOC5_SPI_MODE_TI_PRECEDES_MASK)     | \
                     PSOC5_GET_SPI_CTRL_SCLK_MODE     (PSOC5_SPI_CLOCK_MODE)                | \
                     PSOC5_GET_SPI_CTRL_LATE_MISO_SAMPLE(PSOC5_SPI_LATE_MISO_SAMPLE_ENABLE) | \
                     PSOC5_GET_SPI_CTRL_SUB_MODE      (PSOC5_SPI_SUB_MODE)                  | \
                     PSOC5_GET_SPI_CTRL_MASTER_MODE   (PSOC5_SPI_MODE))

    /* RX direction */
    #define PSOC5_SPI_DEFAULT_RX_CTRL \
                    (PSOC5_GET_RX_CTRL_DATA_WIDTH(PSOC5_SPI_RX_DATA_BITS_NUM)     | \
                     PSOC5_GET_RX_CTRL_BIT_ORDER (PSOC5_SPI_BITS_ORDER)           | \
                     PSOC5_GET_RX_CTRL_MEDIAN    (PSOC5_SPI_MEDIAN_FILTER_ENABLE) | \
                     PSOC5_SPI_RX_CTRL)

    #define PSOC5_SPI_DEFAULT_RX_FIFO_CTRL \
                    PSOC5_GET_RX_FIFO_CTRL_TRIGGER_LEVEL(PSOC5_SPI_RX_TRIGGER_LEVEL)

    /* TX direction */
    #define PSOC5_SPI_DEFAULT_TX_CTRL \
                    (PSOC5_GET_TX_CTRL_DATA_WIDTH(PSOC5_SPI_TX_DATA_BITS_NUM) | \
                     PSOC5_GET_TX_CTRL_BIT_ORDER (PSOC5_SPI_BITS_ORDER)       | \
                     PSOC5_SPI_TX_CTRL)

    #define PSOC5_SPI_DEFAULT_TX_FIFO_CTRL \
                    PSOC5_GET_TX_FIFO_CTRL_TRIGGER_LEVEL(PSOC5_SPI_TX_TRIGGER_LEVEL)

    /* Interrupt sources */
    #define PSOC5_SPI_DEFAULT_INTR_SPI_EC_MASK   (PSOC5_NO_INTR_SOURCES)

    #define PSOC5_SPI_DEFAULT_INTR_I2C_EC_MASK   (PSOC5_NO_INTR_SOURCES)
    #define PSOC5_SPI_DEFAULT_INTR_SLAVE_MASK \
                    (PSOC5_SPI_INTR_RX_MASK & PSOC5_INTR_SLAVE_SPI_BUS_ERROR)

    #define PSOC5_SPI_DEFAULT_INTR_MASTER_MASK \
                    (PSOC5_SPI_INTR_TX_MASK & PSOC5_INTR_MASTER_SPI_DONE)

    #define PSOC5_SPI_DEFAULT_INTR_RX_MASK \
                    (PSOC5_SPI_INTR_RX_MASK & (uint32) ~PSOC5_INTR_SLAVE_SPI_BUS_ERROR)

    #define PSOC5_SPI_DEFAULT_INTR_TX_MASK \
                    (PSOC5_SPI_INTR_TX_MASK & (uint32) ~PSOC5_INTR_MASTER_SPI_DONE)

#endif /* (PSOC5_SCB_MODE_SPI_CONST_CFG) */


/***************************************
*        UART Register Settings
***************************************/

#define PSOC5_CTRL_UART      (PSOC5_CTRL_MODE_UART)
#define PSOC5_UART_RX_CTRL   (PSOC5_RX_CTRL_LSB_FIRST) /* LSB for UART goes first */
#define PSOC5_UART_TX_CTRL   (PSOC5_TX_CTRL_LSB_FIRST) /* LSB for UART goes first */


/***************************************
*      UART Init Register Settings
***************************************/

#if(PSOC5_SCB_MODE_UART_CONST_CFG)

    /* UART configuration */
    #if(PSOC5_UART_MODE_IRDA == PSOC5_UART_SUB_MODE)

        #define PSOC5_DEFAULT_CTRL_OVS   ((0u != PSOC5_UART_IRDA_LOW_POWER) ?              \
                                (PSOC5_UART_GET_CTRL_OVS_IRDA_LP(PSOC5_UART_OVS_FACTOR)) : \
                                (PSOC5_CTRL_OVS_IRDA_OVS16))

    #else

        #define PSOC5_DEFAULT_CTRL_OVS   PSOC5_GET_CTRL_OVS(PSOC5_UART_OVS_FACTOR)

    #endif /* (PSOC5_UART_MODE_IRDA == PSOC5_UART_SUB_MODE) */

    #define PSOC5_UART_DEFAULT_CTRL \
                                (PSOC5_GET_CTRL_ADDR_ACCEPT(PSOC5_UART_MP_ACCEPT_ADDRESS) | \
                                 PSOC5_DEFAULT_CTRL_OVS                                              | \
                                 PSOC5_CTRL_UART)

    #define PSOC5_UART_DEFAULT_UART_CTRL \
                                    (PSOC5_GET_UART_CTRL_MODE(PSOC5_UART_SUB_MODE))

    /* RX direction */
    #define PSOC5_UART_DEFAULT_RX_CTRL_PARITY \
                                ((PSOC5_UART_PARITY_NONE != PSOC5_UART_PARITY_TYPE) ?      \
                                  (PSOC5_GET_UART_RX_CTRL_PARITY(PSOC5_UART_PARITY_TYPE) | \
                                   PSOC5_UART_RX_CTRL_PARITY_ENABLED) : (0u))

    #define PSOC5_UART_DEFAULT_UART_RX_CTRL \
                    (PSOC5_GET_UART_RX_CTRL_MODE(PSOC5_UART_STOP_BITS_NUM)                    | \
                     PSOC5_GET_UART_RX_CTRL_POLARITY(PSOC5_UART_IRDA_POLARITY)                | \
                     PSOC5_GET_UART_RX_CTRL_MP_MODE(PSOC5_UART_MP_MODE_ENABLE)                | \
                     PSOC5_GET_UART_RX_CTRL_DROP_ON_PARITY_ERR(PSOC5_UART_DROP_ON_PARITY_ERR) | \
                     PSOC5_GET_UART_RX_CTRL_DROP_ON_FRAME_ERR(PSOC5_UART_DROP_ON_FRAME_ERR)   | \
                     PSOC5_UART_DEFAULT_RX_CTRL_PARITY)

    #define PSOC5_UART_DEFAULT_RX_CTRL \
                                (PSOC5_GET_RX_CTRL_DATA_WIDTH(PSOC5_UART_DATA_BITS_NUM)        | \
                                 PSOC5_GET_RX_CTRL_MEDIAN    (PSOC5_UART_MEDIAN_FILTER_ENABLE) | \
                                 PSOC5_GET_UART_RX_CTRL_ENABLED(PSOC5_UART_DIRECTION))

    #define PSOC5_UART_DEFAULT_RX_FIFO_CTRL \
                                PSOC5_GET_RX_FIFO_CTRL_TRIGGER_LEVEL(PSOC5_UART_RX_TRIGGER_LEVEL)

    #define PSOC5_UART_DEFAULT_RX_MATCH_REG  ((0u != PSOC5_UART_MP_MODE_ENABLE) ?          \
                                (PSOC5_GET_RX_MATCH_ADDR(PSOC5_UART_MP_RX_ADDRESS) | \
                                 PSOC5_GET_RX_MATCH_MASK(PSOC5_UART_MP_RX_ADDRESS_MASK)) : (0u))

    /* TX direction */
    #define PSOC5_UART_DEFAULT_TX_CTRL_PARITY (PSOC5_UART_DEFAULT_RX_CTRL_PARITY)

    #define PSOC5_UART_DEFAULT_UART_TX_CTRL \
                                (PSOC5_GET_UART_TX_CTRL_MODE(PSOC5_UART_STOP_BITS_NUM)       | \
                                 PSOC5_GET_UART_TX_CTRL_RETRY_NACK(PSOC5_UART_RETRY_ON_NACK) | \
                                 PSOC5_UART_DEFAULT_TX_CTRL_PARITY)

    #define PSOC5_UART_DEFAULT_TX_CTRL \
                                (PSOC5_GET_TX_CTRL_DATA_WIDTH(PSOC5_UART_DATA_BITS_NUM) | \
                                 PSOC5_GET_UART_TX_CTRL_ENABLED(PSOC5_UART_DIRECTION))

    #define PSOC5_UART_DEFAULT_TX_FIFO_CTRL \
                                PSOC5_GET_TX_FIFO_CTRL_TRIGGER_LEVEL(PSOC5_UART_TX_TRIGGER_LEVEL)

    /* Interrupt sources */
    #define PSOC5_UART_DEFAULT_INTR_I2C_EC_MASK  (PSOC5_NO_INTR_SOURCES)
    #define PSOC5_UART_DEFAULT_INTR_SPI_EC_MASK  (PSOC5_NO_INTR_SOURCES)
    #define PSOC5_UART_DEFAULT_INTR_SLAVE_MASK   (PSOC5_NO_INTR_SOURCES)
    #define PSOC5_UART_DEFAULT_INTR_MASTER_MASK  (PSOC5_NO_INTR_SOURCES)
    #define PSOC5_UART_DEFAULT_INTR_RX_MASK      (PSOC5_UART_INTR_RX_MASK)
    #define PSOC5_UART_DEFAULT_INTR_TX_MASK      (PSOC5_UART_INTR_TX_MASK)

#endif /* (PSOC5_SCB_MODE_UART_CONST_CFG) */

#endif /* CY_SCB_SPI_UART_PSOC5_H */


/* [] END OF FILE */
